= Job Application
:neo4j-version: 2.0.0-RC1
:author: John Swain
:twitter: @Swainjo
:tags: domain:recruitment, use-case:recruitment

This interactive Neo4j graph tutorial covers bank fraud detection scenarios.



== Sample Data Set

//setup
[source,cypher]
----

// Create people
CREATE (Person1:Person { 
       		FirstName: "John", 
       		LastName: "Swain", 
       		UniqueId: "Swainjo" }) 
CREATE (Person2:Person { 
       		FirstName: "Gabe", 
       		LastName: "Stanek", 
       		UniqueId: "Stanekga" })
CREATE (Person3:Person { 
       		FirstName: "Rik", 
       		LastName: "Van Bruggen", 
       		UniqueId: "Vanbruggenri" })
CREATE (Person4:Person { 
       		FirstName: "Nicole", 
       		LastName: "White", 
       		UniqueId: "Whiteno" })

// Connect People
CREATE (Person1)-[:IS_LINKEDIN_CONTACT]->(Person3)

// Create Job
CREATE (Job1:Job { 
       		Title: "Pre Sales Engineer" })
// Connect Job
CREATE (Person1)-[:APPLIED_FOR]->(Job1),
	   (Person2)-[:HIRING_FOR]->(Job1)

// Create Skills
CREATE (Skill1:Skill { 
       		Name: "Neo4j" }) 
CREATE (Skill2:Skill { 
       		Name: "Cyper" }) 
CREATE (Skill3:Skill { 
       		Name: "Linux" }) 
CREATE (Skill4:Skill { 
       		Name: "Java" }) 
CREATE (Skill5:Skill { 
       		Name: "SQL" }) 
CREATE (Skill6:Skill { 
       		Name: "Presentation" }) 

// Connect Skills
CREATE (Person1)-[:HAS_SKILL {Years : 1}]->(Skill1),
	   (Person1)-[:HAS_SKILL {Years : 1}]->(Skill2),
	   (Person1)-[:HAS_SKILL {Years : 6}]->(Skill3),
	   (Person1)-[:HAS_SKILL {Years : 20}]->(Skill5),
	   (Person1)-[:HAS_SKILL {Years : 18}]->(Skill6),
	   (Job1)-[:REQUIRES_SKILL {Years : 3}]->(Skill1),
	   (Job1)-[:REQUIRES_SKILL {Years : 3}]->(Skill2),
	   (Job1)-[:REQUIRES_SKILL {Years : 3}]->(Skill3),
	   (Job1)-[:REQUIRES_SKILL {Years : 3}]->(Skill4),
	   (Job1)-[:REQUIRES_SKILL {Years : 3}]->(Skill6)

// Create Experience
CREATE (Experience1:Experience { 
       		Name: "Pre Sales"}) 
CREATE (Experience2:Experience { 
       		Name: "Product Presentation"})
CREATE (Experience3:Experience { 
       		Name: "Product Development"})  

// Connect Experience
CREATE (Person1)-[:HAS_EXPERIENCE {Years : 18}]->(Experience1),
	   (Person1)-[:HAS_EXPERIENCE {Years : 18}]->(Experience2),
	   (Person1)-[:HAS_EXPERIENCE {Years : 12}]->(Experience3), 		      		 
	   (Job1)-[:REQUIRES_EXPERIENCE {Years : 3}]->(Experience1),
	   (Job1)-[:REQUIRES_EXPERIENCE {Years : 3}]->(Experience2),
	   (Job1)-[:REQUIRES_EXPERIENCE {Years : 3}]->(Experience3)

RETURN *
----

//graph

'''

== Job Application Analysis

==== Show relationship between Job and People

[source,cypher]
----
MATCH (j:Job)-[r]-(p:Person) 
RETURN p.FirstName As Name,type(r) as Relationship,j.Title as JobTitle
----

//output
//table
'''
'''
==== Show relationship between Job and People and Skills/Experience

[source,cypher]
----
MATCH (j:Job)-[r1:REQUIRES_SKILL|REQUIRES_EXPERIENCE]-(s)
WITH s
MATCH (s)-[r2:HAS_SKILL|HAS_EXPERIENCE]-(p:Person) 
RETURN 	p.FirstName as Name,type(r2) as Relationship ,s.Name as Skill_Experience, r2.Years as Years
----

//output
//table
