= Job Application
:neo4j-version: 2.0.0-RC1
:author: John Swain
:twitter: @Swainjo
:tags: domain:recruitment, use-case:recruitment

This interactive Neo4j graph tutorial covers bank fraud detection scenarios.



== Sample Data Set

//setup
[source,cypher]
----

// Create people
CREATE (Person1:Person { 
       		FirstName: "John", 
       		LastName: "Swain", 
       		UniqueId: "Swainjo" }) 
CREATE (Person2:Person { 
       		FirstName: "Gabe", 
       		LastName: "Stanek", 
       		UniqueId: "Stanekga" })
CREATE (Person3:Person { 
       		FirstName: "Rik", 
       		LastName: "Van Bruggen", 
       		UniqueId: "Vanbruggenri" })
CREATE (Person4:Person { 
       		FirstName: "Nicole", 
       		LastName: "White", 
       		UniqueId: "Whiteno" })

// Connect People
CREATE (Person1)-[:IS_LINKEDIN_CONTACT]->(Person3)

// Create Job
CREATE (Job1:Job { 
       		Title: "Pre Sales Engineer" })
// Connect Job
CREATE (Person1)-[:APPLIED_FOR]->(Job1),
	   (Person2)-[:HIRING_FOR]->(Job1)

// Create Skills
CREATE (Skill1:Skill { 
       		Name: "Neo4j" }) 
CREATE (Skill2:Skill { 
       		Name: "Pre Sales" }) 
CREATE (Skill3:Skill { 
       		Name: "Linux" }) 
CREATE (Skill4:Skill { 
       		Name: "Java" }) 
CREATE (Skill5:Skill { 
       		Name: "SQL" }) 

// Connect Skills
CREATE (Person1)-[:HAS_SKILL]->(Skill1),
	   (Person1)-[:HAS_SKILL]->(Skill2),
	   (Person1)-[:HAS_SKILL]->(Skill3),
	   (Person1)-[:HAS_SKILL]->(Skill5),
	   (Job1)-[:REQUIRES_SKILL]->(Skill1),
	   (Job1)-[:REQUIRES_SKILL]->(Skill2),
	   (Job1)-[:REQUIRES_SKILL]->(Skill3),
	   (Job1)-[:REQUIRES_SKILL]->(Skill4)

RETURN *
----

//graph

'''

== Job Application Analysis

==== Show relationship between Job and People

[source,cypher]
----
MATCH (j:Job)-[r]-(p:Person) 
RETURN p.FirstName As Name,type(r) as Relationship,j.Title as JobTitle
----

//output
//table
'''
'''
==== Show relationship between Job and People and Skills

[source,cypher]
----
MATCH (j:Job)-[r1:REQUIRES_SKILL]-(s:Skill)
WITH s
MATCH (s)-[r2:HAS_SKILL]-(p:Person) 
RETURN 	p.FirstName as Name,type(r2) as Relationship ,s.Name as Skill
----

//output
//graph
